{
  "name is mud": "If someone's name is mud they are in trouble, disgraced, or discredited.",
  "Nature abhors a vacuum": "fix the date of an important event, especially marriage.",
  "necessity is the mother of invention": "The phrase  is attributed to Aristotle. It means every space in nature needs to be filled with something.",
  "necessity knows no law": "This proverb means that when people really need to do something, they will find a way to do it.",
  "neither fish nor fowl": " is a proverb. It means that being desperate and having no means may lead you to do illegal things.",
  "nervous Nellie": "said of something not easily categorized or not fitting neatly into any established group.",
  "never mind": "A nervous Nellie refers to someone whose personality and usual behavior are characterized by worry, insecurity, and timidity.",
  "next to nothing": "almost; hardly.",
  "almost always.": "nine times out of ten",
  "nine to five": "said about a job with normal daytime hours, a job that begins at nine o'clock in the morning and finishes at five.",
  "no spring chicken": "said of a person who is no longer particularly young.",
  "no use to man or beast": "said about something or someone that is completely useless.",
  "not bat an eyelid": "The phrase  is an idiomatic expression that means to show no reaction or not to display even a hint of an emotional response.",
  "not be short of a bob or two": "The phrase not be short of a bob or two means to have a lot of money.",
  "not come cheap": "said about something that is of good quality and is therefore expensive.",
  "not enough room to swing a cat": "not very much space. Said abut a small place.",
  "not at all.": "not for a minute",
  "not half bad": "Pretty good; okay; decent.",
  "not have a cat in hell's chance": "(also not have a snowball's chance in hell) not to be able to achieve something.",
  "not have a leg to stand on": "not have a sound justification, a firm foundation of facts to prove something.",
  "not have a snowball's chance in hell": "(also not have a cat in hell's chance) not to be able to achieve something.",
  "not hold water": "said when an explanation, a reason or an argument is not sound, strong or logical.",
  "The phrase  means ": "not in a million years",
  "not miss a trick": "This idiom is a . It is an alternative form of .",
  "nothing is certain but death and taxes": "said about someone who is extremely alert.",
  "nothing to sneeze at": "not bad; decent; acceptable; worthwhile.",
  "now or never": "said when you have to do something right now because you may not get another chance to do it later.",
  "nurse someone back to health": "to look after a sick person until he recovers."
}