{
  "sacred cow": "anything someone believes in without ever being able to question or criticize.",
  "safe and sound": "safe and without injury or damage.",
  "safety in numbers": "safety in numbers is the hypothesis that, by being part of a large physical group or mass, an individual is proportionally less likely to be the victim of a mishap, accident, attack, or other bad event.",
  "sail against the wind": "to work to achieve something that is difficult because most people would oppose it.",
  "sail close to the wind": "when you sail close to the wind you act just within the limits of what is legal or acceptable.",
  "sail through something": "To pass or progress quickly and easily.",
  "salt of the earth": "said about somone who is honest and good.",
  "save face": "To take an action or make a gesture intended to preserve one\\'s reputation or honor.",
  "save money for a rainy day": "The phrase  is an idiomatic expression that means    ",
  "say uncle": "Variations of this idiom include:",
  "say your piece": "to admit failure.",
  "scaredy cat": "Tell what you have to say",
  "scarlet woman": "someone who is easily frightened.",
  "scratch one's head": "The phrase  is an idiomatic expression that means to think hard or wonder about something.",
  "scream bloody murder": "Scratching one's head has literal and figurative meanings. Figuratively, the idiom indicates mental bewilderment or puzzlement.",
  "scream blue murder ": "(also shout blue murder or scream bloody murder) to shout or complain loudly because you are annoyed about something.",
  "see a man about a dog": "used as an excuse for leaving without giving the real reason (especially if the reason is to go to the toilet, or to have a drink)",
  "see someone's point": "To understand the meaning that someone is trying to convey.",
  "sell ice to Eskimos": "To persuade people to go against their best interests or to accept something unnecessary or preposterous.",
  "sell like hotcakes": "The phrase  is an idiomatic expression that refers to something that is sold very quickly and in large numbers.",
  "sell your soul to the devil": "The phrase  is an idiomatic expression that means ",
  "send love to someone": "Another variation of the idiom is .",
  "send shivers down someone's spine": "The idiom  refers to an affectionate greeting or message  given to someone.",
  "send up a trial balloon": "to terrify; to make someone feel extremely nervous.",
  "separate the wheat from the chaff": "to test public opinion and response to something.",
  "serve time": "to separate things of value from things of no value.",
  "set a thief to catch a thief": "Saying that someone is serving time means that he is in prison.",
  "set the ball rolling": "The best person to catch a thief is another thief, because he or she knows how thieves think.",
  "set the wheels in motion": "(also start or get the ball rolling) start something, especially a conversation or a social event.",
  "shake a leg": "to initiate a chain of events necessary to help one achieve a goal (more quickly)",
  "shake in one's shoes": "used to tell someone to rouse themselves from sleep and get out of bed.",
  "shape up or ship out": "To either improve one\\'s behavior or else be required to leave; to either improve one\\'s performance in an activity or else withdraw from that activity completely.",
  "she'll be apples": "everything will be all right.",
  "shelf life": "The length of time something will last.",
  "shift gears": "To change what you are doing in a sudden way.",
  "shiver down one's spine": "The phrase  is an idiomatic expression that refers to a feeling of fear excitement, nervousness or anticipation.",
  "shoot the works": "Another variation of this idiom is ",
  "shot across the bow": "to spend all the money you have or to try as much as you can to do something.",
  "shot in the dark": "The phrase  refers to a hopeful attempt at something or a wild guess especially when you have no certain information or knowledge about the subject.",
  "shotgun marriage": "(also shotgun wedding) when the bridegroom is forced to marry the bride he made her pregnant.",
  "shoulder to cry on": "said about a person someone to whom you can tell your problems to and then ask for sympathy, emotional support and advice.",
  "signed, sealed and delivered": "(Also sealed and delivered)       ",
  "sing the same tune": "This expression refers to a document or an agreement which has been officially signed and completed satisfactorily.",
  "sink or swim": "sing from the same hymnsheet/songsheet",
  "sitting duck": "If you are left to , you are left on your own, without any help, and you have no choice but to fail or succeed. The idiom alludes to the choices available to someone who has fallen into the water.",
  "skin and bones": "Said about someone or something vulnerable to attack.",
  "skin someone alive": "to be underweight and look bad, to be extremely thin.",
  "slice of life": "to punish someone severely.",
  "snake in one's bosom": "The phrase  refers to a realistic representation of everyday experience in art and entertainment (e.g. a movie, play, book..)",
  "snake in the grass": "The phrase  refers to a treacherous or deceitful person. ",
  "snake oil salesman": "A person who pretends to be your friend while secretly trying to do things to harm you.",
  "soaked to the bone": "The phrase  means to be completely wet or drenched.    ",
  "speak of the devil": "The phrase  very sour and disagreeable.",
  "speak the same language": "The phrase  is the short form of the idiom . It is used about someone who appears unexpectedly while being talked about.",
  "spill the beans": "to reveal a secret.",
  "spring chicken": "To be old; not young anymore.",
  "Spuntnick moment": "The phrase  refers to a moment of challenge when a society or person realizes they must work harder to surpass their competitors. ",
  "stage whisper": "If you say something in , you say it in a loud whisper with the intention of being overheard.",
  "stand the test of time": "If something , it lasts for a long time.",
  "state of the art": "The phrase  refers to something that reflects the highest level of development, something that is very up-to-date.",
  "step into somebody's shoes": "to take over someone's place or job.",
  "stick to one's guns": "To  means to refuse to change one's convictions or beliefs.",
  "stiff upper lip": "One who has a stiff upper lip displays fortitude in the face of adversity, or exercises self-restraint in the expression of emotion.",
  "stir up a hornets' nest": "If you , you make trouble.",
  "stool pigeon": "A decoy or an informer, especially one who is a spy for the police.",
  "stop the music": "stop everything.",
  "storm is brewing": "The phrase  is an idiomatic expression that means that there is going to be a storm. It may also mean that there is going to be trouble or emotional upset in the near future.",
  "strapped for cash": "The idiom  to be short of money.",
  "strike a chord": "If something strikes a chord with you, it reminds you of something, it seems familiar to you or you are interested in it.",
  "sweat blood": "to work very hard.",
  "sweep something under the carpet": "(also sweep something under the rug.) to hide or ignore something.",
  "sweep something under the rug": "To hide something because it's embarassing.",
  "swim against the tide": "The phrase  means to do something that is in opposition to the prevailing opinion or tendency. "
}