{
  "call a spade a spade": "to be truthful about something, even if it is rude or unpleasant.",
  "call it a day": "to stop working for the rest of the day.",
  "call off the dogs": "said when you want someone to stop criticizing you.",
  "call on the carpet": "To reprimand; to censure severely or angrily.",
  "call someone names": "to call someone by unpleasant, abusive or insulting names.",
  "call the shots": "If you  you are in charge. You decide on the course of action and take the initiative.",
  "call the tune": "to be the one who controls a situation; to have the most power and authority in a situation",
  "calm before the storm": "the calm before the storm is an unussual or false quiet period before a period of upheaval.",
  "The phrase  means ": "cannot stomach someone or something",
  "Captain Obvious": "Another variation of this idiom is ",
  "carrot and stick": "The phrase uses  in the sense of a comic book super-hero.",
  "carry a tune": "an offer involving a reward countered by the threat of punishment.",
  "carry the ball": "The phrase  means to sing a melody accurately.",
  "case in point": "to take charge and control of an activity and be considered reliable enough to do a job.",
  "case-by-case": "an example that illustrates a point",
  "cash cow": "Separate and distinct from others of the same kind.",
  "castles in the air": "Plans that are unlikely to happen.",
  "cat burglar": "A cat burglar refers to a thief who enters a building by skillfully climbing to a building without attracting notice.",
  "cat got your tongue": "Why aren't you speaking?",
  "catch someone's eye": "The phrase  means to get someone's attention.",
  "caught in a time warp": "The phrase  is an idiomatic expression that means to remain unchanged from a time in the past although everything else has. ",
  "caught in the crossfire ": "Another variation of this idiom is  or .",
  "chalk something up to inexperience": "This phrase is an idiomatic expression that literally means . Figuratively, the phrase refers to a situation in which one is caught between opposing people arguing about something,  making it difficult to remain neutral.",
  "charity begins at home": "To attribute a failure to inexperience and learn from that particular experience.",
  "charmed life": " is a proverb. It means that,  before deciding to take care of other people,  one's family should be one's foremost concern.",
  "chew the cud": "This idiom is used when someone tries to pursue unrealistic or fanciful goals, things that are impossible.",
  "chew the fat": "To waste time talking or to chat idly.",
  "chicken out": "To refuse to do something because of fear.",
  "not brave.": "chicken-hearted",
  "chin music": "talk, conversation",
  "clean as a whistle": "If someone is as clean as a whistle they are perfectly clean.",
  "click with someone or something": "The phrase  means to immediately like someone or something.",
  "clock on": "To register one's arrival at work",
  "clock out": "(Also clock off) To register one's departure from work.",
  "close to home": "If something is , it affects you personally.",
  "Clothes make the man": "The phrase  ids a proverb that means that people are judged according to the way they are dressed.",
  "cloud nine": "This idiom is used to mean that you are in a state of extreme happiness.",
  "cock-and-bull story": "The phrase  is an idiomatic expression that refers to a story or explanation which is obviously not true.",
  "cog in the machine": "The origin of the phrase probably comes from some fable in which a cock and bull figure.",
  "coining it": "(also a cog in the wheel) said about one part of a large system or organization",
  "coining money": "(also coining money) to be earning a lot of money quickly.",
  "cold day in hell": "(also coining it, mintining it) earning a lot of money quickly.",
  "cold piece of work": "If someone is a cold piece of work they are difficult to deal with.",
  "come clean": "to be honest and tell the truth.",
  "to hit or punish somebody.": "come down on somebody like a ton of bricks",
  "come from behind": "to win after being in a losing position in a game.",
  "come hell or high water": "said when you are determined to do something despite difficulties.",
  "come into bloom": "to blossom, to start to produce flowers.",
  "come into money": "If you , you get some money unexpectedly, usually by inheritance.",
  "come of age": "Other variants of this idiom:",
  "come out of the closet": "The phrase come of age means to reach adulthood.",
  "come out of the woodwork": "The phrase  means to admit publicly one's homosexuality.",
  "come to terms with": "Another variation of this idiom is:",
  "come rain or shine": "(Also rain or shine) Regardless of the weather or circumstances.",
  "come to a head": "The phrase  is an idiomatic expression. It is used to indicate that a situation suddenly becomes worse.",
  "come to fruition": "to have fight or an argument with someone.",
  "come to your attention": "to gradually accept a sad situation.",
  "come true": "(also come to your notice) said when you notice something.",
  "come under fire": "said when something happens although it was unlikely that it would.",
  "common as an old shoe": "to be subject of criricism.",
  "company man": "(also (as) common as dirt) low class; unrefined; ill-mannered; uncouth.",
  "con artist": "The phrase  refers to a worker who is more loyal to his employer than to his fellow workers.",
  "cool as a cucumber": "The phrase  refers to a person who makes a living by swindling people.",
  "coon's age": "very calm.",
  "cost a bomb": "The phrase  is an idiomatic expression that refers to something that is extremely expensive.",
  "cost an arm and a leg": "Other variation of this idiom include:",
  "couch potato": "2. 'It takes a leg...",
  "count one's chickens before they hatch": "Lazy person.",
  "cream of the crop": "To assume success too early, before it is certain.",
  "crime doesn't pay": "The phrase  means the best of all.",
  "cross swords": "This idiom is used to suggest that crime will ultimately not benefit a person.",
  "crux of the matter": "to quarrel or argue with someone; to have a dispute with someone.",
  "cry wolf": "Crux has a Latin origin referring to a real cross and its association with torment. In English the term means .",
  "cupboard love": "to ask for help when there is really no danger.",
  "curiosity killed the cat": "Curiosity killed the cat is a proverb used to warn someone not to be too curious about something and ask too many questions because this can get you into trouble.",
  "curl your lip": "an upward movement of the side of the mouth to show dislike and disrespect.",
  "cut a rug": "To dance.",
  "cut one's throat": "The phrase  or  means to bring about one's own ruin and downfall.",
  "cut your losses": "This idiom is used to mean that you should do something to avoid losing any more money."
}