{
  "hale and hearty": "in a good health.",
  "hand in the till": "To have , means to steal from one's employer.",
  "The word  refers to a drawer, small chest, or compartment for money, as in a store.": "Another variation of this idiom is:",
  "handle someone with kid gloves": "to be very careful and polite to a person because you don't want to hurt him or her, or you don't want to to make him or her angry or upset.",
  "hands are tied": "If your , you are unable to help, intervene or act.",
  "Another variant of this idiom is:": "to be very excited, restless, anxious or worried about something.",
  "have big ears": "to be nosy and listen to other people's private conversations.",
  "have bigger fish to fry": "(also have other fish to fry; have more important fish to fry) to have other things to do; to have more important things to do.",
  "have egg on one's face": "The phrase  means to be embarrassed by something one has done.",
  "There are different speculations about the origin of the phrase:": "1. Because soft-boiled egg was a common breakfast dish, sometimes one would have accidental runny egg on one's face, causing some embarrassment.",
  "2. When a performance was strongly disliked, the audience would pelt the performer with things, including raw eggs. This was obviously a source of embarrassment.": "have friends in high places",
  "to know powerful people.": "have kittens",
  "(also have a cow) to be very worried, upset or angry about something.": "have money to burn",
  "to be very rich and spend a lot of money on unnecessary things.": "have one's wires crossed",
  "(also get one's wires crossed) to be confused.": "have other fish to fry",
  "(Also have bigger fish to fry; have more important fish to fry)to have other things to do; to have more important things to do.": "have something down to a science",
  "said when you are able to manage doing something very well.": "have the hots for someone",
  "To be strongly sexually attracted to someone.": "have time on your hands",
  "The phrase  is an idiomatic expression that means that one has extra time.": "have to face the music",
  "accept or face the unpleasant consequences of one's actions.": "have too much on one's plate",
  "The idiom  means to be too busy.": "Another variation of this idiom is .",
  "he that would the daughter win, must with the mother first begin": "This is a proverb which means that if you intend to marry a woman, first try to win her mother on your side.",
  "head over heels": "completely in love.",
  "heart of gold": "A person with a  is a person who is very kind and has a good nature. ",
  "It is an idiomatic expression that alludes to gold as a precious metal. In this sense, a person with a heart of gold refers to someone who has a heart which is valued for its goodness.": "heavy weather",
  "The phrase  refers to considerable difficulty. ": "The expression alludes to bad weather at sea.   ",
  "An variant of this idiom is:": "See a related idiom:",
  "help a lame dog over a stile": "said about someone who helps people who are in difficulty or trouble.",
  "high man on the totem pole": "the most important person in a hierarchy or organization. (Opposite: low man on the totem pole)",
  "high time": "If it's  you did something, it is the appropriate time for it.",
  "highway robbery": "This expression is used to refer to a price or a fee that is  exorbitantly high.",
  "highways and byways": "major and minor roads.",
  "hit a home run": "to be successful.",
  "hit the ceiling": "to become very angry and start shouting.",
  "hit the nail on the head": "said to describe exactly a situation or a problem.",
  "hit the panic button": "(also press or push the button)to panic suddenly.",
  "hit the road": "To begin traveling; to leave a place; to go away.",
  "hit the roof": "to become angry and start shouting.",
  "hitch one's wagon to a star": "aspire to do something great or aim high, follow a great ambition.",
  "hold someone accountable (for something)": "to consider someone responsible for something.",
  "home away from home": "(also home from home) a place where you are at ease as if you were at home.",
  "home free": "to be certain of being successful because you have finished the most difficult part.",
  "home truth": "The phrase  refers to an unpleasant fact about oneself.",
  "It is usually in the plural form: .": "horse of a different color",
  "(also horse of another color) a different matter.": "Hot potato",
  "An awkward or delicate problem with which nobody wants to be associated.": "how come?"
}