{
  "made of money": "be rich.",
  "magic touch": "a special skill to do something very well.",
  "magic wand": "a quick and an easy way to solve a problem",
  "make a clean breast of": "to tell the truth; to confess.",
  "make a fast buck": "(also make quick buck) to earn money without much effort.",
  "make a man of someone": "(also make a man out of someone) to make a young person become more experienced or act like an adult and take responsibility.",
  "make a monkey out of": "(also make a fool out of someone) to cause a person, group, or action to appear foolish or inferior; to subject someone or something to ridicule.",
  "make a mountain out of a molehill": "To exagerate the severity of a situation; to make a lot of fuss about nothing.",
  "make a pig of oneself": "said about someone who eats too much or too fast.",
  "make an honest buck": "The phrase  is an idiomatic expression that means to make an honest living.",
  "make chin music": "talk or chatter.",
  "make heavy weather of something": "The phrase  to find something hard to do and make a fuss about it although it is not difficult.",
  "See a related idiom:": "make love, not war",
  "A hippie anti-war slogan encouraging love and peace.": "make one's way",
  "To move in a particular direction; advance in life by one's own efforts.": "make somebody's mouth water",
  "When the smell or sight of food is extremely good it makes your mouth water.": "make waves",
  "to cause trouble.": "make yourself at home",
  "If you say to someone , this means that you ask them to consider themselves as if they were in their own homes.": "man cannot live by bread alone",
  "used to mean that things like poetry, art, music, etc are necassary for people just as food.": "man in the street",
  "(Also, woman in the street)": "This idiom is used to describe an ordinary person.",
  "man of his word": "The idiom  refers to someone whom you can trust because he keeps his promises and always do what he says.",
  "man of means": "Also a woman of means.",
  "The phrase  refers to someone who is very rich.": "man of straw",
  "A weak person.": "man's home is his castle",
  "This idiom suggest tha people are free to do whatever they want to in their own home": "mark my words",
  "Listen to me; used before a statement one wishes to emphasize.": "marked man",
  "(Also marked woman)": "The idiom  refers to someone who is singled out as a target for vengeance or attack.",
  "marry money": "to marry a rich person.",
  "match made in heaven": "The phrase a match made in heaven refers to two people, so well-suited to each other that their marriage is likely to be happy and successful.",
  "The phrase may also refer to a very successful combination of two people or things.": "matter of time",
  "The phrase  is used to say that something will certainly happen.": "meat and two veg",
  "The male genitals.": "Mecca for someone or something",
  "If a place is a , it is a place that a lot of people visit because it is known for something that they want to see or do.": "Mecca is the religious city of Islam. It is a city where Muslims go for pilgrimage.",
  "meet one's death": "(Also meet one's end) To die.",
  "meet your Waterloo": "If someone  they are defeated by someone who is stronger or by a problem that is very difficult to surmount.     ",
  "The phrase  refers to the Battle of Waterloo near Belgium  in 1815 where the French army under the command of Napoleon was defeated. The phrase entered the English language as a phrase signifying a great test with a final and decisive outcome - generally one resulting in failure and proving vincibility for something or someone who had seemed unbeatable.": "memory like a sieve",
  "To have a  means to have a very poor memory.": "men in blue",
  "The phrase  or  refers to the police or policemen.": "men make houses, women make homes",
  "It's often the men who build or acquire houses for their families, but it's usually women who provide the things that make a house into a home.": "middle of the road",
  "having a centrist attitude or philosophy; not extreme, especially politically.": "minting it",
  "(also minting money) earning a lot of money quickly.": "minting money",
  "(also minting money) Earning a lot of money quickly.": "misery loves company",
  "The phrase misery loves company means that if someone is miserable, they like others to be miserable too so that they can feel better about themselves.": "miss the boat",
  "To fail to take advantage of an opportunity.": "Mister Right",
  "A perfect, ideal or suitable mate or husband.": "moment in the sun",
  "A brief instance in which an otherwise obscure, unremarkable, or humble person draws attention.": "moment of truth",
  "A deciding instant; the time when a test determines or makes it apparent whether something will succeed.": "money for jam",
  "(also be money for old rope) said about a job when it is an easy way of earning money.": "money for old rope",
  "(also be money for jam) Said about a job when it is an easy way of earning money.": "money spinner",
  "a business or product that makes a lot of money for someone.": "money talks",
  "money talks suggest that with money people can get whatever they want.": "music to someone's ears",
  "Some good news; a spoken expression or a sound which is pleasing; a welcome remark or information.": "my gut tells me",
  "The phrase  is an idiomatic expression that means ": "Literally, the term  means  The whole phrase makes reference to one's gut reaction or gut response to something.",
  "my way or the highway": "This expression is used to say that people have to  do what you say; otherwise, they will have to leave or quit the project."
}