{
  "oceans of ": "A large amount of something.",
  "odd duck": "An unusual person, especially an individual with an idiosyncratic personality or peculiar behavioral characteristics.",
  "odds and ends": "various often worthless small items.",
  "of a certain age": "Said about people who are not young.",
  "of advanced age": "The phrase of advanced age or advanced years describes someone as old.",
  "of age": "Old enough to be considered an adult.",
  "of the first water": "of the best.",
  "off the beaten track": "To a place or places not commonly visited.",
  "off the shelf": "ready made for purchase; in a form that is ready to be used.",
  "off the wagon": "The phrase  is an idiomatic expression that refers to someone who no longer abstains from a habit or an addiction like alcoholic drinks.",
  "The opposite of this expression is , meaning maintaining a program of self-improvement or abstinence from some undesirable habits. ": "The origin of the idiom \"off the wagon\"",
  "The expression probably comes from the early 20th-century American idiom . This expression referred to someone who was drinking water instead of alcoholic drinks as an attempt to stop drinking. The expression likely preceded its opposite to fall .": "old wives' tale",
  "a wrong traditional theory or belief, often about health.": "on a shoestring",
  "The phrase  is an idiomatic expression.  ": "If you do something on a shoestring, you do it with a very small amount of money.",
  "on all fours": "On all fours mean on one's hands and knees.",
  "on in years": "Old; advanced in age.",
  "on the face of it": "on the surface.",
  "on the horns of a dilemma": "To face a choice between two equally undesirable alternatives.",
  "on the run": "Fleeing or running from the police.",
  "on the same wavelength": "thinking in the same pattern or in agreement.",
  "on the table": "being discussed or considered.",
  "on the take": "This idiom is used to describe a person who is in a position of authority and takes or seeks to take bribes or illegal income.",
  "on the wagon": "To abstain from drinking any alcoholic drink, usually in the sense of having given it up",
  "once bitten, twice shy": "If someone is said to be once bitten, twice shy, it means that once someone was hurt by something or someone, they will be afraid to try it again.",
  "once in a blue moon": "The phrase  is an idiomatic expression that means  or ",
  " refers to an additional full moon that appears very rarely during a year. ": "The phrase has nothing to do with the actual color of the moon. It just means that something happens very rarely.",
  "one of a kind": "The phrase  is an idiomatic expression that means ",
  "one's word is law": "The idiom  means that what someone says must be obeyed.",
  "one-day wonder": "The phrase  refers to something or someone that attracts great interest for a short time but is subsequently forgotten.",
  "Variations of this idiom include:": "one-off",
  "Occurring once; one-time.": "out of the blue",
  "something which is totally unexpected.": "over my dead body",
  "If you say something will happen over your dead body, you mean that you will not allow it to happen.": "over my dead body",
  "Under no circumstances; absolutely not.": "over the hill"
}