{
  "rabbit hole": "(From Alice in Wonderland) A way into a bizarre world.",
  "race against time": "To  means to hurry to do something before a deadline.",
  "rack one's brain": "(also rack one's brains) to think very hard about something.",
  "rags to riches": "The phrase  refers to any situation in which a person rises from poverty to wealth.",
  "rain cats and dogs": "to rain heavily. It's raining cats and dogs.",
  "rain or shine": "(also come rain or shine) whatever happens; no matter whether it is rainy or sunny.",
  "raise eyebrows": "To cause surprise or mild disapproval.",
  "raw deal": "said when someones is ill treated.",
  "read the riot act": "if you read the riot act to someone, you warn or reprimand them energetically or forcefully",
  "red flag": "A sign or signal that something is wrong cue, it is a warning, or alert.",
  "red handed": "be discovered in or just after the act of doing something wrong or illegal",
  "red ink": "a euphemism for financial loss.",
  "red-letter day": "a particularly significant day (personal or sectarian), usually very positive, sometimes very negative.",
  "reinvent the wheel": "to waste one's time doing something that has already been done satisfactorily.",
  "religious about doing something": "If someone is , they are strict and conscientious about it.",
  "ride shotgun": "To  means to sit in the front passenger seat of a vehicle during a trip. Figuratively, the phrase refers to the support or aid given to someone in a situation or project.",
  "The expression  is derived from , a colloquial term for . A special armed employee of the express service using the stage for transportation of bullion or cash would sit beside the driver, carrying a short shotgun (or alternatively a rifle), to provide an armed response in case of threat to the cargo.": "More about riding shotgun on ",
  "right as rain": "This idiom is used to mean that everything is perfectly fine; all right",
  "right down to": "considering even minor things or people.",
  "right on the button": "to be exactly right.",
  "ripe old age": "Very old age.",
  "road rage": "Aggressive behavior exhibited by drivers in traffic, often as a result of stress.",
  "roll one's sleeves up": "The phrase  literally means to turn one's sleeves upward. Figuratively,  the idioms means to prepare for hard work.",
  "Rome wasn't built in a day": "said to emphasize that great work takes time to do. Nothing of importance can be done in a short period of time.",
  "roof something over": "to build a roof over something.",
  "root and branch": "completely.",
  "rough time": "The idiom  means a hard or bad time.",
  "round the clock": "The phrase  refers to something happening or done all day and all night.",
  "Another variation of this idiom is:": "run a red light",
  "The phrase  is an idiom that means to continue driving through an intersection having a red traffic light without stopping.": "run for one's life",
  "To run for your life means to run away to save one's life.": "run out of steam",
  "If you , you lose  the energy, enthusiasm or interest to continue doing something.": "run with the hare and hunt with the hounds",
  "To support both sides of an argument.": "running battle"
}