{
  "pack a wallop": "(also pack a punch) to provide energy, power, or excitement.",
  "paddle one's own canoe": "To act independently and decide your own fate; to do something by oneself.",
  "pain in the neck": "an annoyance.",
  "paint something with a broad brush": "The phrase  means to describe something in general terms, without mentioning specific details and without paying attention to individual variations.",
  "party hearty": "The phrase  means to have a good time; to celebrate.  ",
  "Another variation of this idiom is:": "pass the buck",
  "to blame others for something you shoud accept reponsibilty for.": "pass the hat around",
  "(also pass the hat round) to collect money by asking people or organizations.": "patience of Job",
  "To have the patience of Job means to have a great amount of patience.  ": "The idiom has a religious origin. Job was considered a prophet in the Abrahamic Religions: Islam, Christianity and Judaism. He suffered from horrendous disasters that took away all that he held dear, including his offspring, his health, and his property.",
  "patient as Job": "The phrase  means ",
  "The idiom alludes to the biblical figure Job. He is presented as a good and prosperous family man who is beset with horrendous disasters that take away all that he holds dear, including his offspring, his health, and his property. He struggles to understand his situation and begins a search for the answers to his difficulties": "Another variation of the idiom is :",
  ".": "pay dearly",
  "to suffer because of a particlar action.": "pay lip service",
  "an insincere loyalty, respect, or support for something": "pay your dues",
  "The phrase  means to earn respect or a position by a lot of hard work and sacrifice.": "pick of the bunch",
  "(also the best of the bunch) the best.": "pick up the tab",
  "The idiom  means to pay the bill.": "Another variation of this idiom is .",
  "picture of (good) health": "in a very healthy condition.",
  "picture paints a thousand words": "(also a picture is worth a thousand words) a picture will be far more descriptive of something than words can ever be.",
  "pipe dream": "The phrase  refers to a goal that is impossible to accomplish.",
  "play a joke ": "(also play trick) to deceive someone for fun.",
  "play away from home": "to be unfaithful; to have sex with someone who is not your usual partner.",
  "play ball": "to cooperate and agree to work with others.",
  "play cat and mouse": "to tease, confuse or fool someone by trying to trick them into making a mistake so that you have an advantage over them.",
  "play hardball with someone": "The phrase  means ",
  "play second fiddle": "to take a subordinate or weaker position than someone else.",
  "play the field": "to have many sexual relationships.",
  "poetic justice": "The phrase  refers to a situation in which virtue is rewarded and vice is punished, in such a way that this justice seems proper and ironic.",
  "The phrase originates from the English drama critic Thomas Rymer who coined the phrase in  to describe how a work should inspire proper moral behaviour in its audience by illustrating the triumph of good over evil.": "More on ",
  "poetry in motion": "If something is , it is something that is graceful and beautiful to observe.",
  "poison pill": "The phrase  refers to  is a type of defensive tactic used by companies against a takeover.",
  "poke one's nose in": "The phrase  means to be nosy ; to interfere with something. It has the sense of intruding in another's private life.",
  " means to prod or jab especially with something pointed such as a finger, a stick, an elbow...": "Another variation of this idiom is:",
  "possession is nine points of the law": "is a phrase used to suggest that if you really possess something, you will easily claim its ownership than someone who just says it belongs to him or her.",
  "The phrase comes from the early English property system, where the right to possession of property was endorsed by the king in the form of nine traditional writs. These writs evolved into the nine original laws defining property ownership, hence the expression \"possession is nine points in the law.\"": "poverty is no sin",
  "The phrase  means that we shouldn't condemn people for their poverty. ": "Another variation of this idiom is ",
  "poverty is not a crime": "(Also poverty is no sin)",
  " This expression is used to mean that it is not a crime to be poor and that we shouldn't condemn people for their poverty.": "preach to the choir",
  "The phrase  or  means to ​try to convince people of something that they already ​believe.": "pressed for time",
  "If you are , it means that you are in a hurry.": "prick of conscience",
  "The phrase  is an idiomatic expression that indicates a feeling of guilt. The phrase makes reference to a feeling that causes a sharp mental pain or remorse.": "Another variation of the idiom is . It means .",
  "public enemy number one": "The idiom public enemy number one refers someone or something that people hate.",
  "pull in one's horns": "(also draw in one's horn) To become less impassioned, aggressive, or argumentative; to back down from a fight; to yield or capitulate.",
  "pull somebody's leg": "to tease or fool someone when trying to convince them to believe something which is not true as a joke.",
  "Pull the other leg ": "used when you do not believe what someone has just said.",
  "Pull the other one": "used to tell someone that you don't believe what they have just said.",
  "pull the plug": "The phrase  means to put an end to an activity, preventing it from continuing.",
  "puppy love": "A childish or youthful infatuation with another person.",
  "push someone's buttons": "(also press someone's buttons) draw a strong emotional reaction from someone, especially anger or sexual arousal.",
  "put  the cart before the horse": "To put things in the wrong order",
  "put a smile on someone's face": "The phrase  is an idiomatic expression that means to please someone or make someone happy.",
  "Another variation of this idiom is  or ": "put money on somebody or something",
  "to bet money or to believe that someone will accomplish something or that something will happen.": "put on a brave face",
  "to pretend that a problem doesn't bother you.": "put one's heart into something",
  "The phrase  is an idiomatic expression that means ": "Other variations of this idiom are:",
  "put one's mind to it": "To apply oneself; to exert a directed effort.",
  "put one's shoulder to the wheel": "to start hard work; to begin to toil.",
  "put the cat among the pigeons": "To create a disturbance and cause trouble.",
  "put the pedal to the metal": "To press the gas pedal to the maximum extent; to exert maximum effort.",
  "put words in somebody's mouth": "To attribute to somebody something he or she did not say; to claim inaccurately that somebody said or intended something.",
  "put years on": "If something , it makes them look or feel much older.",
  "put yourself in someone's shoes": "To see how it feels when you put yourself in someone's place.",
  "This phrase has been credited as a Native American aphorism. Some however think that it has its origin in Mary T. Lathrap's poem published in 1895. The original title of the poem was Judge Softly, later titled Walk a Mile in His Moccasins.": "Similar idioms:"
}