{
  "dad fetch my buttons": "said to express a surprise.",
  "dance on someone's grave": "To celebrate a person's death triumphantly.",
  "dance with death": "try to do something that involves a lot of risks.",
  "dark horse": "The phrase  is an idiomatic expression that refers to a usually  little-known person who unexpectedly wins or succeeds, especially in a competition of some sort.",
  "The first known mention of the phrase is in Benjamin Disraeli's novel  (1831). Disraeli's protagonist, the Duke of St. James, attends a horse race with a surprise finish: \"A dark horse which had never been thought of, and which the careless St. James had never even observed in the list, rushed past the grandstand in sweeping triumph.\"": "More on this idiom on ",
  "darken someone's door": "To darken someone's door means to be an unwelcome visitor.",
  "daydream about someone or something": "This phrase means to have fantasies about someone or something while one is awake.",
  "dead and buried": "No longer in use or under consideration,  irrelevant, forgotten.",
  "dead duck": "said about someone or something that is is doomed to failure or death.",
  "dead loss": "something described as a dead loss is absolutely unsuccessful or useless (a complete failure)",
  "dead meat": "Someone in danger of death or severe punishment.",
  "dead right": "If someone is , it means that they are absolutely correct.",
  "dead serious": "The phrase  is an idiomatic expression that means one is absolutely serious and is not joking.",
  "dead to the world": "Said about someone who is sound asleep or unconscious.",
  "dead wood": "Workers no longer contributing to an organization.",
  "desert a sinking ship": "The phrase  means ",
  " is a related phrase. The reference to rats can be explained by the fact that they are reported to be the first ones to flee a sinking ship or a min where there is a gas leak. The idea is that if rats leave a mine or a ship, it's wise to follow.": "devil finds work for idle hands to do",
  "People are inclined to do frivolous or harmful things to get rid of their boredom when they don't do anything useful.": "devil of a time",
  "If you have a , you have a very difficult time.": "devil-may-care",
  "careless, reckless or defiant.": "dice with death",
  "To do something which is very risky, or dangerous, and could even cause one's death.": "dime a dozen",
  "Said about anything that is common, inexpensive, and easy to get or available any where.": "dip your toe in the water",
  "(also dip a toe in the water) said when you start something carefully because you are not sure whether it will work or not.": "dirty work",
  "(also do the dirty work) unpleasant work or dishonest action.": "do a number on",
  "The phrase  is an idiomatic expression that means ": "do the dirty work",
  "The phrase do the dirty work means to do the disagreeable, illegal or dishonest things.": "do the trick ",
  "said about something that works.": "dog's age",
  "The idiom  refers to a long period of time.": "A  is a variation of this idiom.",
  "dog's life": "a miserable, unhappy existence.",
  "dog-eat-dog": "said about a world where people do anything to be successful.",
  "dogs are barking": "If your , this means that your feet are hurting.",
  "Interesting fact:": "There is a brand of shoes called . The connection between this brand and the expression \"\" is obvious: the shoes  are supposedly so comfortable and your feet won't hurt when you wear them.",
  "dollars to donuts": "This idiomatic expression is used to suggest that something is very likely to be true or that one is certain about something.",
  "don't get me wrong": "an expression said when you fear someone does not understand what you say.",
  "done to death": "if something is done to death, it is used or discussed so many times that it has become boring.",
  "doormat": "The phrase  or  describes a weak person who is abused by others and submits to domination.",
  "double-edged sword": "A benefit that carries some significant but non-obvious cost or risk.",
  "drag one's feet": "To procrastinate, put off; to dawdle, avoid, or make progress slowly and reluctantly.",
  "drama queen": "The phrase  refers to a person who tends to react to every event or situation in an over-dramatic or exaggerated way.",
  "drastic times call for drastic measures": "The idiom  means that when you face extreme and undesirable situations, it is sometimes necessary to take extreme actions.",
  " is another variation of the idiom.": "draw fire",
  "If you , you attract hostile criticism.": "draw in one's horns",
  "(also pull in one's horns) to become less impassioned, aggressive, or argumentative; to back down from a fight; to yield or capitulate.": "draw the curtain on / over",
  "To draw the curtain on or over something means to bring it to an end.": "draw the shortest straw",
  "To be selected to do an undesirable task (by drawing the shortest straw or otherwise).": "dream come true",
  "The phrase  refers to something that you have always hoped for and that has happened.": "dream on",
  "The phrase  is an idiomatic expression used to express skepticism and say that something is unlikely to happen.": "A related idiom:",
  "dream ticket": "The phrase  refers to an ideal alliance between two people, usually candidates in an election.",
  "dressed up to the nines": "when someone is dressed up to the nines, they are wearing fashionable or formal clothes for a special occasion.",
  "drink like a fish": "to drink alcohol excessively.",
  "drive a hard bargain": "Negotiate forcefully.",
  "drive someone up the wall": "To irritate or annoy someone; to make a person very angry or bored; to infuriate.",
  "drop a bombshell": "The phrase  refers to an alarming and unexpected  announcement.",
  "drop a dime": "to drop a dime means to make a phone call, usually calling the police to inform on or betray someone.",
  "drop in the bucket": "Something so strong that it doesn't count or doesn't have any importance or significance.",
  "drop the subject": "to stop discussing a subject."
}